apemangr/Repetidor-nRF52-SDK-17.1.0/app_nus_server.c
#include "app_nus_server.h"
#include "app_nus_client.h"
#include "app_timer.h"
#include "app_uart.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "ble_nus.h"
#include "bsp_btn_ble.h"
#include "calendar.h"
#include "fds.h"
#include "filesystem.h"
#include "nrf.h"
#include "nrf_ble_gatt.h"
#include "nrf_ble_qwr.h"
#include "nrf_delay.h"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "nrf_sdh_soc.h"
#include "variables.h"

#define APP_BLE_CONN_CFG_TAG           1
#define DEVICE_NAME                    "Repetidor"
#define NUS_SERVICE_UUID_TYPE          BLE_UUID_TYPE_VENDOR_BEGIN
#define APP_BLE_OBSERVER_PRIO          3
#define APP_ADV_INTERVAL               64
#define APP_ADV_DURATION               18000
#define MIN_CONN_INTERVAL              MSEC_TO_UNITS(20, UNIT_1_25_MS)
#define MAX_CONN_INTERVAL              MSEC_TO_UNITS(75, UNIT_1_25_MS)
#define SLAVE_LATENCY                  0
#define CONN_SUP_TIMEOUT               MSEC_TO_UNITS(4000, UNIT_10_MS)
#define FIRST_CONN_PARAMS_UPDATE_DELAY APP_TIMER_TICKS(5000)
#define NEXT_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(30000)
#define MAX_CONN_PARAMS_UPDATE_COUNT   3
#define DEAD_BEEF                      0xDEADBEEF
#define LARGO_ADVERTISING              0x18 // Largo_Advertising  10 son 16 y 18 son 24

uint8_t m_beacon_info[LARGO_ADVERTISING];

BLE_NUS_DEF(m_nus, NRF_SDH_BLE_TOTAL_LINK_COUNT);
NRF_BLE_QWR_DEF(m_qwr);
BLE_ADVERTISING_DEF(m_advertising);

static bool                              m_emisor_nus_ready     = false;
static app_nus_server_on_data_received_t m_on_data_received     = 0;
static uint16_t                          m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3;
static uint16_t                          m_conn_handle          = BLE_CONN_HANDLE_INVALID;
static uint16_t                          m_emisor_conn_handle   = BLE_CONN_HANDLE_INVALID;
static uint8_t                           custom_mac_addr_[6]    = {0};
static ble_gap_addr_t                    m_target_periph_addr;

static ble_uuid_t m_adv_uuids[] = {{BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}};

// Función para realizar la recolección de basura
static void perform_garbage_collection(void)
{
    ret_code_t err_code = fds_gc();
    if (err_code == NRF_SUCCESS)
    {
        NRF_LOG_RAW_INFO("\n\t>> Recoleccion de basura completada.");
    }
    else
    {
        NRF_LOG_RAW_INFO("\n\t>> Error en la recoleccion de basura: %d", err_code);
    }
}

ret_code_t send_configuration_nus(config_t const *config_repetidor)
{
    if (config_repetidor == NULL)
    {
        NRF_LOG_ERROR("send_configuration_nus: config_repetidor is NULL");
        return NRF_ERROR_NULL;
    }

    // Verificar que hay conexión NUS activa
    if (m_conn_handle == BLE_CONN_HANDLE_INVALID)
    {
        NRF_LOG_WARNING("send_configuration_nus: No hay conexión NUS activa");
        return NRF_ERROR_INVALID_STATE;
    }

    // Buffer binario para los datos
    // 2 bytes identificador + 33 bytes datos = 35 bytes total
    uint8_t  binary_data[35];
    uint8_t *ptr = binary_data;

    NRF_LOG_RAW_INFO(
        "\n\n\x1b[1;36m=== Enviando configuracion en formato binario optimizado ===\x1b[0m");

    // Añadir bytes identificadores 0xCC, 0xAA al inicio
    *ptr++ = 0xCC;
    *ptr++ = 0xAA;

    // 1. MAC del repetidor (6 bytes) - en orden inverso para formato little endian
    for (int i = 5; i >= 0; i--)
    {
        *ptr++ = config_repetidor->mac_repetidor_config[i];
    }

    // 2. MAC del emisor (6 bytes) - en orden inverso para formato little endian
    for (int i = 5; i >= 0; i--)
    {
        *ptr++ = config_repetidor->mac_emisor_config[i];
    }

    // 3. Tiempo de encendido (4 bytes, little endian)
    uint32_t tiempo_on = config_repetidor->tiempo_encendido_config;
    *ptr++             = (uint8_t)(tiempo_on & 0xFF);
    *ptr++             = (uint8_t)((tiempo_on >> 8) & 0xFF);
    *ptr++             = (uint8_t)((tiempo_on >> 16) & 0xFF);
    *ptr++             = (uint8_t)((tiempo_on >> 24) & 0xFF);

    // 4. Tiempo de dormido (4 bytes, little endian)
    uint32_t tiempo_sleep = config_repetidor->tiempo_dormido_config;
    *ptr++                = (uint8_t)(tiempo_sleep & 0xFF);
    *ptr++                = (uint8_t)((tiempo_sleep >> 8) & 0xFF);
    *ptr++                = (uint8_t)((tiempo_sleep >> 16) & 0xFF);
    *ptr++                = (uint8_t)((tiempo_sleep >> 24) & 0xFF);

    // 5. Tiempo de búsqueda (4 bytes, little endian)
    uint32_t tiempo_search = config_repetidor->tiempo_busqueda_config;
    *ptr++                 = (uint8_t)(tiempo_search & 0xFF);
    *ptr++                 = (uint8_t)((tiempo_search >> 8) & 0xFF);
    *ptr++                 = (uint8_t)((tiempo_search >> 16) & 0xFF);
    *ptr++                 = (uint8_t)((tiempo_search >> 24) & 0xFF);

    // 6. Versión del firmware (3 bytes)
    *ptr++ = config_repetidor->version[0];
    *ptr++ = config_repetidor->version[1];
    *ptr++ = config_repetidor->version[2];

    // Enviar los datos binarios
    ret_code_t err_code = app_nus_server_send_data(binary_data, sizeof(binary_data));
    if (err_code != NRF_SUCCESS)
    {
        const char *error_msg;
        switch (err_code)
        {
        case NRF_ERROR_INVALID_STATE:
            error_msg = "Estado inválido (sin conexión o notificaciones deshabilitadas)";
            break;
        case NRF_ERROR_RESOURCES:
            error_msg = "Buffer de transmisión lleno";
            break;
        case NRF_ERROR_INVALID_PARAM:
            error_msg = "Parámetros inválidos";
            break;
        case NRF_ERROR_BUSY:
            error_msg = "Servicio ocupado";
            break;
        default:
            error_msg = "Error desconocido";
            break;
        }

        NRF_LOG_ERROR("Error enviando configuración binaria: 0x%X (%s)", err_code, error_msg);
        NRF_LOG_RAW_INFO("\n> Estado conexión: handle=0x%04X, activa=%s",
                         m_conn_handle,
                         (m_conn_handle != BLE_CONN_HANDLE_INVALID) ? "SI" : "NO");

        // Ejecutar diagnóstico completo cuando hay error

        return err_code;
    }

    // Log de información enviada (mostrar en hexadecimal para debugging)
    NRF_LOG_RAW_INFO("\n> Configuración binaria enviada (%d bytes):", sizeof(binary_data));
    NRF_LOG_RAW_INFO("\n> Datos hex: ");
    for (int i = 0; i < sizeof(binary_data); i++)
    {
        NRF_LOG_RAW_INFO("%02X", binary_data[i]);
    }

