apemangr/Repetidor-nRF52-SDK-17.1.0/app_nus_server.c
    NRF_LOG_RAW_INFO("\n> Decodificación:");
    NRF_LOG_RAW_INFO("\n  - Identificador: 0x%02X 0x%02X", binary_data[0], binary_data[1]);
    NRF_LOG_RAW_INFO("\n  - MAC Repetidor: %02X:%02X:%02X:%02X:%02X:%02X",
                     config_repetidor->mac_repetidor_config[5],
                     config_repetidor->mac_repetidor_config[4],
                     config_repetidor->mac_repetidor_config[3],
                     config_repetidor->mac_repetidor_config[2],
                     config_repetidor->mac_repetidor_config[1],
                     config_repetidor->mac_repetidor_config[0]);
    NRF_LOG_RAW_INFO("\n  - MAC Emisor: %02X:%02X:%02X:%02X:%02X:%02X",
                     config_repetidor->mac_emisor_config[5],
                     config_repetidor->mac_emisor_config[4],
                     config_repetidor->mac_emisor_config[3],
                     config_repetidor->mac_emisor_config[2],
                     config_repetidor->mac_emisor_config[1],
                     config_repetidor->mac_emisor_config[0]);

    NRF_LOG_RAW_INFO("\n  - Tiempo ON: %lu ms", config_repetidor->tiempo_encendido_config);
    NRF_LOG_RAW_INFO("\n  - Tiempo SLEEP: %lu ms", config_repetidor->tiempo_dormido_config);
    NRF_LOG_RAW_INFO("\n  - Tiempo SEARCH: %lu ms", config_repetidor->tiempo_busqueda_config);
    NRF_LOG_RAW_INFO("\n  - Versión FW: %u.%u.%u",
                     config_repetidor->version[0],
                     config_repetidor->version[1],
                     config_repetidor->version[2]);

    NRF_LOG_RAW_INFO("\n\x1b[1;32m=== Configuración binaria enviada exitosamente ===\x1b[0m");
    return NRF_SUCCESS;
}

static void fds_evt_handler(fds_evt_t const *p_evt)
{
    if (p_evt->id == FDS_EVT_INIT)
    {
        if (p_evt->result == NRF_SUCCESS)
        {
            NRF_LOG_RAW_INFO("\n\033[1;31m>\033[0m Iniciando el modulo de almacenamiento...\n");

            fds_stat_t stat = {0};
            fds_stat(&stat);
            NRF_LOG_RAW_INFO("\t>> Se encontraron %d registros validos.\n", stat.valid_records);
            NRF_LOG_RAW_INFO("\t>> Se encontraron %d registros no validos.", stat.dirty_records);

            if (stat.dirty_records > 0)
            {
                // Realiza la recolección de basura
                NRF_LOG_RAW_INFO("\n\t>> Limpiando registros no validos...");
                perform_garbage_collection();
            }
            NRF_LOG_RAW_INFO("\n\t>> \033[0;32mModulo inicializado correctamente.\033[0m");
        }
        else
        {
            NRF_LOG_RAW_INFO("\nError al inicializar FDS: %d", p_evt->result);
        }
    }
    else if (p_evt->id == FDS_EVT_WRITE)
    {
        if (p_evt->result == NRF_SUCCESS)
        {
            NRF_LOG_RAW_INFO("\n\x1b[1;32m>> Registro escrito correctamente!\x1b[0m");
        }
        else
        {
            NRF_LOG_ERROR("Error al escribir el registro: %d", p_evt->result);
        }
    }
    else if (p_evt->id == FDS_EVT_UPDATE)
    {
        if (p_evt->result == NRF_SUCCESS)
        {
            // NRF_LOG_RAW_INFO(
            //     "\n\n\x1b[1;32m>>\x1b[0m Registro actualizado correctamente!");
        }
        else
        {
            NRF_LOG_ERROR("Error al actualizar el registro: %d", p_evt->result);
        }
    }
    else if (p_evt->id == FDS_EVT_DEL_RECORD)
    {
        if (p_evt->result == NRF_SUCCESS)
        {
            NRF_LOG_RAW_INFO("\nRegistro eliminado correctamente.");
        }
        else
        {
            NRF_LOG_ERROR("Error al eliminar el registro: %d", p_evt->result);
        }
    }
    else if (p_evt->id == FDS_EVT_DEL_FILE)
    {
        if (p_evt->result == NRF_SUCCESS)
        {
            NRF_LOG_RAW_INFO("\nArchivo eliminado correctamente y todos los registros asociados.");
        }
        else
        {
            NRF_LOG_ERROR("Error al eliminar el archivo: %d", p_evt->result);
        }
    }
}

static void fds_initialize(void)
{
    ret_code_t err_code;

    // Registra el manejador de eventos
    err_code = fds_register(fds_evt_handler);
    APP_ERROR_CHECK(err_code);

    // Inicializa el módulo FDS
    err_code = fds_init();
    APP_ERROR_CHECK(err_code);
}
/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may
 * need to inform the application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went
 * wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART
 * BLE Service and send it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t *p_evt)
{
    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {
        uint32_t err_code;

        NRF_LOG_DEBUG("Received data from BLE NUS. Writing data on UART.");
        NRF_LOG_HEXDUMP_DEBUG(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);

        // Asegúrate de que el mensaje sea tratado como una cadena de texto
        char message[BLE_NUS_MAX_DATA_LEN]; // +1 para el carácter nulo
        if (p_evt->params.rx_data.length < sizeof(message))
        {
            memcpy(message, p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);

            message[p_evt->params.rx_data.length] = '\0'; // Agregar terminador nulo

            // Imprime el mensaje recibido
            NRF_LOG_RAW_INFO("\n\n\x1b[1;36m--- Mensaje recibido: \x1b[0m%s", message);

            // Verifica si el mensaje comienza con "111" par interpretar el comando
            if (p_evt->params.rx_data.length >= 5 && message[0] == '1' && message[1] == '1' &&
                message[2] == '1')
            {
                // Extrae el comando (los dos caracteres después de "111")
                char command[3] = {message[3], message[4], '\0'}; // Comando de 2 caracteres

                // Manejo de comandos con un switch-case
                switch (atoi(command)) // Convierte el comando a entero
                {
                case 1: // Comando 01: Guardar MAC
                {
                    size_t mac_length = p_evt->params.rx_data.length - 5;
                    if (mac_length == 12) // Verifica que la longitud sea válida
                    {
                        for (size_t i = 0; i < 6; i++)
                        {
                            char byte_str[3] = {message[5 + i * 2], message[6 + i * 2], '\0'};
                            custom_mac_addr_[5 - i] = (uint8_t)strtol(byte_str, NULL, 16);
                        }
                        NRF_LOG_RAW_INFO("\n\n\x1b[1;36m--- Comando 01 recibido: "
                                         "Cambiar MAC \x1b[0m");
                        NRF_LOG_RAW_INFO("\n> MAC recibida: "
                                         "%02X:%02X:%02X:%02X:%02X:%02X",
                                         custom_mac_addr_[5],
                                         custom_mac_addr_[4],
                                         custom_mac_addr_[3],
                                         custom_mac_addr_[2],
                                         custom_mac_addr_[1],
                                         custom_mac_addr_[0]);

                        // Guarda la MAC en la memoria flash y reinicia el
                        // dispositivo
                        save_mac_to_flash(custom_mac_addr_, MAC_FILTRADO);
                    }
                    else
                    {
                        NRF_LOG_WARNING("Longitud de MAC inválida: %d", mac_length);
                    }
                    break;
                }
                case 2: // Comando 02: Muestra la MAC custom guardada en la
                    // memoria flash
                    {
                        uint8_t mac_print[6];
                        // Carga la MAC desde la memoria flash
                        NRF_LOG_RAW_INFO("\n\n\x1b[1;36m--- Comando 02 recibido: Mostrando "
                                         "MAC "
                                         "guardada \x1b[0m");
                        load_mac_from_flash(mac_print, MAC_FILTRADO);
                        // muestra la MAC
                    }

                    break;

