apemangr/Repetidor-nRF52-SDK-17.1.0/app_nus_server.c
                                // Preparar array de datos en formato hex (igual que
                                // send_all_history)
                                uint8_t  data_array[244];
                                uint16_t position = 0;

                                // Byte 0: Magic
                                data_array[position++] = 0x08;

                                // Bytes 1-7: Fecha y hora
                                data_array[position++] = registro_historial.day;
                                data_array[position++] = registro_historial.month;
                                data_array[position++] = (registro_historial.year >> 8) & 0xFF;
                                data_array[position++] = (registro_historial.year & 0xFF);
                                data_array[position++] = registro_historial.hour;
                                data_array[position++] = registro_historial.minute;
                                data_array[position++] = registro_historial.second;

                                // Bytes 8-11: Contador (4 bytes) - convertir a big-endian
                                data_array[position++] = (registro_historial.contador >> 24) & 0xFF;
                                data_array[position++] = (registro_historial.contador >> 16) & 0xFF;
                                data_array[position++] = (registro_historial.contador >> 8) & 0xFF;
                                data_array[position++] = (registro_historial.contador & 0xFF);

                                // Bytes 12-15: V1, V2 (2 bytes cada uno) - convertir a big-endian
                                data_array[position++] = (registro_historial.V1 >> 8) & 0xFF;
                                data_array[position++] = (registro_historial.V1 & 0xFF);
                                data_array[position++] = (registro_historial.V2 >> 8) & 0xFF;
                                data_array[position++] = (registro_historial.V2 & 0xFF);

                                // Byte 16: Battery
                                data_array[position++] = registro_historial.battery;

                                // Bytes 17-28: MACs (rellenar con ceros)
                                for (int j = 0; j < 12; j++)
                                {
                                    data_array[position++] = 0x00;
                                }

                                // Bytes 29-40: V3-V8 (2 bytes cada uno) - convertir a big-endian
                                data_array[position++] = (registro_historial.V3 >> 8) & 0xFF;
                                data_array[position++] = (registro_historial.V3 & 0xFF);
                                data_array[position++] = (registro_historial.V4 >> 8) & 0xFF;
                                data_array[position++] = (registro_historial.V4 & 0xFF);
                                data_array[position++] = (registro_historial.V5 >> 8) & 0xFF;
                                data_array[position++] = (registro_historial.V5 & 0xFF);
                                data_array[position++] = (registro_historial.V6 >> 8) & 0xFF;
                                data_array[position++] = (registro_historial.V6 & 0xFF);
                                data_array[position++] = (registro_historial.V7 >> 8) & 0xFF;
                                data_array[position++] = (registro_historial.V7 & 0xFF);
                                data_array[position++] = (registro_historial.V8 >> 8) & 0xFF;
                                data_array[position++] = (registro_historial.V8 & 0xFF);

                                // Byte 41: Temperatura
                                data_array[position++] = registro_historial.temp;

                                // Byte 42-43: ID del registro solicitado (en lugar de
                                // last_position)
                                data_array[position++] = (registro_id >> 8) & 0xFF;
                                data_array[position++] = (registro_id & 0xFF);

                                // Enviar por NUS al celular
                                ret_code_t send_result =
                                    app_nus_server_send_data(data_array, position);
                                if (send_result == NRF_SUCCESS)
                                {
                                    NRF_LOG_RAW_INFO("\n\x1b[1;32m> Registro #%u enviado por NUS "
                                                     "exitosamente\x1b[0m",
                                                     registro_id);
                                }
                                else
                                {
                                    NRF_LOG_RAW_INFO("\n\x1b[1;31m> Error enviando registro #%u "
                                                     "por NUS: 0x%X\x1b[0m",
                                                     registro_id,
                                                     send_result);
                                }

                                // También imprimir en consola para depuración
                                char titulo[41];
                                snprintf(titulo,
                                         sizeof(titulo),
                                         "Historial enviado \x1B[33m#%u\x1B[0m",
                                         registro_id);
                                print_history_record(&registro_historial, titulo);
                                NRF_LOG_FLUSH();
                            }
                            else
                            {
                                NRF_LOG_RAW_INFO(
                                    "\n\x1b[1;31m> Error al leer el registro %u: 0x%X\x1b[0m",
                                    registro_id,
                                    err_code);
                            }
                        }
                        else
                        {
                            NRF_LOG_WARNING("ID de registro demasiado largo.");
                        }
                    }
                    break;
                }

                case 13: // Comando 13 - Borra historial por ID
                {

