apemangr/Repetidor-nRF52-SDK-17.1.0/app_nus_server.c
                    NRF_LOG_RAW_INFO("\n\n\x1b[1;36m--- Comando 13 recibido: Solicitar el borrado "
                                     "de un historial por ID\x1b[0m");

                    if (p_evt->params.rx_data.length > 5)
                    {
                        size_t id_len    = p_evt->params.rx_data.length - 5;
                        char   id_str[8] = {0};

                        if (id_len < sizeof(id_str))
                        {
                            memcpy(id_str, &message[5], id_len);
                            id_str[id_len]       = '\0';
                            uint16_t registro_id = (uint16_t)atoi(id_str);

                            NRF_LOG_RAW_INFO("\n> ID a borrar: %u (%s)", registro_id, id_str);

                            err_code = delete_history_record_by_id(registro_id);
                        }
                        else
                        {
                            NRF_LOG_WARNING("ID de registro demasiado largo.");
                        }
                    }
                    else
                    {
                        NRF_LOG_WARNING("Comando 13 recibido con datos insuficientes.");
                    }

                    break;
                }

                case 14: // Pide lectura de todos los historiales
                {
                    NRF_LOG_RAW_INFO(
                        "\n\n\x1b[1;36m--- Comando 14: Solicitud del historial completo\x1b[0m");
                    // Llama a la función para solicitar el historial completo
                    send_all_history();

                    break;
                }

                case 15: // Guardar MAC custom del repetidor
                {
                    size_t mac_length = p_evt->params.rx_data.length - 5;
                    if (mac_length == 12)
                    {
                        for (size_t i = 0; i < 6; i++)
                        {

                            char byte_str[3] = {message[5 + i * 2], message[6 + i * 2], '\0'};
                            custom_mac_addr_[5 - i] = (uint8_t)strtol(byte_str, NULL, 16);
                        }

                        NRF_LOG_RAW_INFO("\n\n\x1b[1;36m--- Comando 15 recibido: Guardar MAC del "
                                         "repetidor\x1b[0m");
                        NRF_LOG_RAW_INFO(
                            "\n> MAC del repetidor recibida: %02X:%02X:%02X:%02X:%02X:%02X",
                            custom_mac_addr_[5],
                            custom_mac_addr_[4],
                            custom_mac_addr_[3],
                            custom_mac_addr_[2],
                            custom_mac_addr_[1],
                            custom_mac_addr_[0]);

                        // Guardar la MAC del repetidor en la memoria flash
                        save_mac_to_flash(custom_mac_addr_, MAC_REPEATER);
                    }
                    break;
                }
                case 16: // Leer MAC custom del repetidor
                {

                    NRF_LOG_RAW_INFO(
                        "\n\n\x1b[1;36m--- Comando 16 recibido: Leer MAC del repetidor\x1b[0m");

                    uint8_t repeater_mac[6];
                    load_mac_from_flash(repeater_mac, MAC_REPEATER);

                    // Verificar si hay una MAC válida guardada
                    bool mac_is_zero = true;
                    for (int i = 0; i < 6; i++)
                    {
                        if (repeater_mac[i] != 0)
                        {
                            mac_is_zero = false;
                            break;
                        }
                    }

                    if (!mac_is_zero)
                    {
                        char response[26];
                        snprintf(response,
                                 sizeof(response),
                                 "REPEATER_MAC:%02X%02X%02X%02X%02X%02X",
                                 repeater_mac[5],
                                 repeater_mac[4],
                                 repeater_mac[3],
                                 repeater_mac[2],
                                 repeater_mac[1],
                                 repeater_mac[0]);
                        app_nus_server_send_data((uint8_t *)response, strlen(response));
                    }
                    else
                    {
                        NRF_LOG_RAW_INFO("\n> No hay MAC del repetidor configurada");
                        app_nus_server_send_data((uint8_t *)"REPEATER_MAC_NONE", 17);
                    }
                    break;
                }

                case 17: // Envía la configuracion del repetidor
                {

                    NRF_LOG_RAW_INFO("\n\n\x1b[1;36m--- Comando 17 recibido: Envia la configuracion"
                                     " del repetidor\x1b[0m");
                    send_configuration_nus(&config_repetidor);
                    NRF_LOG_FLUSH();
                    break;
                }

                case 99: // Comando para borrar todos los historiales
                {
                    NRF_LOG_RAW_INFO("\n\n\x1b[1;36m--- Comando 99 recibido: Borrar todos los "
                                     "historiales\x1b[0m");

                    delete_all_history();
                    break;
                }
                default: // Comando desconocido
                    NRF_LOG_WARNING("Comando desconocido: %s", command);
                    break;
                }
            }
            else
            {
                // Reenvía el mensaje al emisor o lo maneja normalmente
                if (m_on_data_received)
                {
                    m_on_data_received((uint8_t *)message, p_evt->params.rx_data.length);
                }
            }
        }
        else
        {
            NRF_LOG_WARNING("Mensaje demasiado largo para procesar.");
        }
    }
    else if (p_evt->type == BLE_NUS_EVT_TX_RDY)
    {
        // El buffer de transmisión está listo - enviar siguiente paquete del comando 15/16 si está
        // activo También manejar el envío asíncrono de historial
        history_send_next_packet();
    }
}

static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code =
        sd_ble_gap_device_name_set(&sec_mode, (const uint8_t *)DEVICE_NAME, strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code                          = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing services that will be used by the
 * application.
 */
static void services_init(void)
{
    uint32_t           err_code;
    ble_nus_init_t     nus_init;
    nrf_ble_qwr_init_t qwr_init = {0};

